Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes
The DetailViewLabelMarkPropertyElementTypes class represents the available property element types for detail view label marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes.DetailName
Returns the detail name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes.Scale
Returns the scale property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes.DrawingName
Returns the drawing name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes.SourceDrawingName
Returns the source drawing name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes.SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Returns: The requested property element type.